IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_gpio_data_regs.xml
<module id="GPIO_DATA_REGS" HW_revision="" description="GPIO DATA Registers">
	<register id="GPADAT" width="32" page="1" offset="0x0" internal="0" description="GPIO A Data Register (GPIO0 to 31)">
		<bitfield id="GPIO0" description="Data Register for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO1" description="Data Register for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO2" description="Data Register for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO3" description="Data Register for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO4" description="Data Register for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO5" description="Data Register for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO6" description="Data Register for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO7" description="Data Register for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO8" description="Data Register for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO9" description="Data Register for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO10" description="Data Register for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO11" description="Data Register for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO12" description="Data Register for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO13" description="Data Register for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO14" description="Data Register for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO15" description="Data Register for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO16" description="Data Register for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO17" description="Data Register for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO18" description="Data Register for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO19" description="Data Register for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO20" description="Data Register for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO21" description="Data Register for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO22" description="Data Register for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO23" description="Data Register for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO24" description="Data Register for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO25" description="Data Register for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO26" description="Data Register for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO27" description="Data Register for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO28" description="Data Register for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO29" description="Data Register for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO30" description="Data Register for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO31" description="Data Register for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPASET" width="32" page="1" offset="0x2" internal="0" description="GPIO A Data Set Register (GPIO0 to 31)">
		<bitfield id="GPIO0" description="Output Set bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO1" description="Output Set bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO2" description="Output Set bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO3" description="Output Set bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO4" description="Output Set bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO5" description="Output Set bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO6" description="Output Set bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO7" description="Output Set bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO8" description="Output Set bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO9" description="Output Set bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO10" description="Output Set bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO11" description="Output Set bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO12" description="Output Set bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO13" description="Output Set bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO14" description="Output Set bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO15" description="Output Set bit for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO16" description="Output Set bit for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO17" description="Output Set bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO18" description="Output Set bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO19" description="Output Set bit for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO20" description="Output Set bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO21" description="Output Set bit for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO22" description="Output Set bit for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO23" description="Output Set bit for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO24" description="Output Set bit for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO25" description="Output Set bit for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO26" description="Output Set bit for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO27" description="Output Set bit for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO28" description="Output Set bit for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO29" description="Output Set bit for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO30" description="Output Set bit for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO31" description="Output Set bit for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPACLEAR" width="32" page="1" offset="0x4" internal="0" description="GPIO A Data Clear Register (GPIO0 to 31)">
		<bitfield id="GPIO0" description="Output Clear bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO1" description="Output Clear bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO2" description="Output Clear bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO3" description="Output Clear bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO4" description="Output Clear bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO5" description="Output Clear bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO6" description="Output Clear bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO7" description="Output Clear bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO8" description="Output Clear bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO9" description="Output Clear bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO10" description="Output Clear bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO11" description="Output Clear bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO12" description="Output Clear bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO13" description="Output Clear bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO14" description="Output Clear bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO15" description="Output Clear bit for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO16" description="Output Clear bit for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO17" description="Output Clear bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO18" description="Output Clear bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO19" description="Output Clear bit for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO20" description="Output Clear bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO21" description="Output Clear bit for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO22" description="Output Clear bit for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO23" description="Output Clear bit for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO24" description="Output Clear bit for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO25" description="Output Clear bit for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO26" description="Output Clear bit for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO27" description="Output Clear bit for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO28" description="Output Clear bit for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO29" description="Output Clear bit for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO30" description="Output Clear bit for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO31" description="Output Clear bit for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
