IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_gpio_data_regs.xml
	<register id="GPCDAT" width="32" page="1" offset="0x10" internal="0" description="GPIO C Data Register (GPIO64 to 95)">
		<bitfield id="GPIO64" description="Data Register for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO65" description="Data Register for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO66" description="Data Register for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO67" description="Data Register for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO68" description="Data Register for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO69" description="Data Register for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO70" description="Data Register for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO71" description="Data Register for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO72" description="Data Register for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO73" description="Data Register for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO74" description="Data Register for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO75" description="Data Register for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO76" description="Data Register for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO77" description="Data Register for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO78" description="Data Register for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO79" description="Data Register for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO80" description="Data Register for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO81" description="Data Register for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO82" description="Data Register for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO83" description="Data Register for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO84" description="Data Register for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO85" description="Data Register for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO86" description="Data Register for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO87" description="Data Register for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO88" description="Data Register for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO89" description="Data Register for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO90" description="Data Register for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO91" description="Data Register for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO92" description="Data Register for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO93" description="Data Register for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO94" description="Data Register for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO95" description="Data Register for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPCSET" width="32" page="1" offset="0x12" internal="0" description="GPIO C Data Set Register (GPIO64 to 95)">
		<bitfield id="GPIO64" description="Output Set bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO65" description="Output Set bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO66" description="Output Set bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO67" description="Output Set bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO68" description="Output Set bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO69" description="Output Set bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO70" description="Output Set bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO71" description="Output Set bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO72" description="Output Set bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO73" description="Output Set bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO74" description="Output Set bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO75" description="Output Set bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO76" description="Output Set bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO77" description="Output Set bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO78" description="Output Set bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO79" description="Output Set bit for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO80" description="Output Set bit for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO81" description="Output Set bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO82" description="Output Set bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO83" description="Output Set bit for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO84" description="Output Set bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO85" description="Output Set bit for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO86" description="Output Set bit for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO87" description="Output Set bit for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO88" description="Output Set bit for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO89" description="Output Set bit for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO90" description="Output Set bit for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO91" description="Output Set bit for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO92" description="Output Set bit for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO93" description="Output Set bit for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO94" description="Output Set bit for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO95" description="Output Set bit for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPCCLEAR" width="32" page="1" offset="0x14" internal="0" description="GPIO C Data Clear Register (GPIO64 to 95)">
		<bitfield id="GPIO64" description="Output Clear bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO65" description="Output Clear bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO66" description="Output Clear bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO67" description="Output Clear bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO68" description="Output Clear bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO69" description="Output Clear bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO70" description="Output Clear bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO71" description="Output Clear bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO72" description="Output Clear bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO73" description="Output Clear bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO74" description="Output Clear bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO75" description="Output Clear bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO76" description="Output Clear bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO77" description="Output Clear bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO78" description="Output Clear bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO79" description="Output Clear bit for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO80" description="Output Clear bit for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO81" description="Output Clear bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO82" description="Output Clear bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO83" description="Output Clear bit for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO84" description="Output Clear bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO85" description="Output Clear bit for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO86" description="Output Clear bit for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO87" description="Output Clear bit for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO88" description="Output Clear bit for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO89" description="Output Clear bit for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO90" description="Output Clear bit for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO91" description="Output Clear bit for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO92" description="Output Clear bit for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO93" description="Output Clear bit for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO94" description="Output Clear bit for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO95" description="Output Clear bit for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPCTOGGLE" width="32" page="1" offset="0x16" internal="0" description="GPIO C Data Toggle Register (GPIO64 to 95) ">
		<bitfield id="GPIO64" description="Output Toggle bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO65" description="Output Toggle bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO66" description="Output Toggle bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO67" description="Output Toggle bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO68" description="Output Toggle bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO69" description="Output Toggle bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO70" description="Output Toggle bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO71" description="Output Toggle bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO72" description="Output Toggle bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO73" description="Output Toggle bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO74" description="Output Toggle bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO75" description="Output Toggle bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO76" description="Output Toggle bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO77" description="Output Toggle bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO78" description="Output Toggle bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO79" description="Output Toggle bit for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO80" description="Output Toggle bit for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO81" description="Output Toggle bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO82" description="Output Toggle bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO83" description="Output Toggle bit for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO84" description="Output Toggle bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO85" description="Output Toggle bit for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO86" description="Output Toggle bit for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO87" description="Output Toggle bit for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO88" description="Output Toggle bit for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO89" description="Output Toggle bit for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO90" description="Output Toggle bit for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO91" description="Output Toggle bit for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO92" description="Output Toggle bit for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO93" description="Output Toggle bit for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO94" description="Output Toggle bit for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO95" description="Output Toggle bit for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPDDAT" width="32" page="1" offset="0x18" internal="0" description="GPIO D Data Register (GPIO96 to 127)">
		<bitfield id="GPIO96" description="Data Register for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO97" description="Data Register for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO98" description="Data Register for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO99" description="Data Register for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO100" description="Data Register for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO101" description="Data Register for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO102" description="Data Register for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO103" description="Data Register for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO104" description="Data Register for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO105" description="Data Register for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO106" description="Data Register for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO107" description="Data Register for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO108" description="Data Register for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO109" description="Data Register for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO110" description="Data Register for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO111" description="Data Register for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO112" description="Data Register for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO113" description="Data Register for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO114" description="Data Register for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO115" description="Data Register for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO116" description="Data Register for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO117" description="Data Register for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO118" description="Data Register for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO119" description="Data Register for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO120" description="Data Register for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO121" description="Data Register for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO122" description="Data Register for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO123" description="Data Register for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO124" description="Data Register for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO125" description="Data Register for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO126" description="Data Register for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO127" description="Data Register for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPDSET" width="32" page="1" offset="0x1a" internal="0" description="GPIO D Data Set Register (GPIO96 to 127)">
		<bitfield id="GPIO96" description="Output Set bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO97" description="Output Set bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO98" description="Output Set bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO99" description="Output Set bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO100" description="Output Set bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO101" description="Output Set bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO102" description="Output Set bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO103" description="Output Set bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO104" description="Output Set bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO105" description="Output Set bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO106" description="Output Set bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO107" description="Output Set bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO108" description="Output Set bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO109" description="Output Set bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO110" description="Output Set bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO111" description="Output Set bit for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO112" description="Output Set bit for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO113" description="Output Set bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO114" description="Output Set bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO115" description="Output Set bit for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO116" description="Output Set bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO117" description="Output Set bit for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO118" description="Output Set bit for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO119" description="Output Set bit for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO120" description="Output Set bit for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO121" description="Output Set bit for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO122" description="Output Set bit for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO123" description="Output Set bit for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO124" description="Output Set bit for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO125" description="Output Set bit for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO126" description="Output Set bit for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO127" description="Output Set bit for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
